Cross-Tenant Synchronization  
Any activity related to cross-tenant access policy changes run the following query.  
``` 
AuditLogs
| where TimeGenerated >ago(90d)
| where Category contains "CrossTenant"


AuditLogs
| where Category == "CrossTenantAccessSettings" or  Category =="CrossTenantIdentitySyncSettings"
```

